{
    "displayName": "CA2.04 Standard - Office 365 - Require compliant device for desktop apps",
    "createdDateTime": null,
    "modifiedDateTime": null,
    "state": "disabled",
    "sessionControls": null,
    "conditions": {
        "signInRiskLevels": [],
        "clientAppTypes": [
			"mobileAppsAndDesktopClients"
		],
        "platforms": {
			"includePlatforms": [
				"windows",
				"macOS"
			],
			"excludePlatforms": []
		},		
        "locations": null,
        "deviceStates": null,
        "applications": {
            "includeApplications": [
                "Office365"
            ],
            "excludeApplications": [],
            "includeUserActions": []
        },
        "users": {
            "includeUsers": [
                "All"
            ],
            "excludeUsers": [
				"GuestsOrExternalUsers"
			],
            "includeGroups": [],
            "excludeGroups": [
				"<EmergencyAccessGroup>"
			],
            "includeRoles": [],
            "excludeRoles": []
        }
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": [
            "compliantDevice"
        ],
        "customAuthenticationFactors": [],
        "termsOfUse": []
    }
}