{
    "displayName": "CA2.05 Standard - Office 365 - Block downloads for unmanaged devices",
    "createdDateTime": null,
    "modifiedDateTime": null,
    "state": "disabled",
    "sessionControls": null,
    "conditions": {
        "signInRiskLevels": [],
        "clientAppTypes": [
			"All"
		],
        "platforms": null,
        "locations": null,
        "deviceStates": null,
        "applications": {
            "includeApplications": [
                "Office365"
            ],
            "excludeApplications": [],
            "includeUserActions": []
        },
        "users": {
            "includeUsers": [
                "All"
            ],
            "excludeUsers": [
				"GuestsOrExternalUsers"
			],
            "includeGroups": [],
            "excludeGroups": [
				"<EmergencyAccessGroup>"
			],
            "includeRoles": [],
            "excludeRoles": []
        }
    },
    "grantControls": {
        "operator": "AND",
        "builtInControls": [],
        "customAuthenticationFactors": [],
        "termsOfUse": []
    },
	"sessionControls": {
		"disableResilienceDefaults": false,
        "cloudAppSecurity": null,
        "persistentBrowser": null,
        "continuousAccessEvaluation": null,
        "secureSignInSession": null,
        "signInFrequency": null,
		"applicationEnforcedRestrictions": {
			"isEnabled": true
			}
	}
}