{
    "displayName": "CA2.03 Strict - Require compliant device for mobile access",
    "createdDateTime": null,
    "modifiedDateTime": null,
    "state": "disabled",
    "sessionControls": null,
    "conditions": {
        "signInRiskLevels": [],
        "clientAppTypes": null,
        "platforms": {
			"includePlatforms": [
				"android",
				"iOS"
			],
			"excludePlatforms": []
		},		
        "locations": null,
        "deviceStates": null,
        "applications": {
            "includeApplications": [
                "All"
            ],
            "excludeApplications": [],
            "includeUserActions": []
        },
        "users": {
            "includeUsers": [
                "All"
            ],
            "excludeUsers": ["GuestsOrExternalUsers"],
            "includeGroups": [],
            "excludeGroups": [
				"<EmergencyAccessGroup>"
			],
            "includeRoles": [],
            "excludeRoles": []
        }
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": [
            "compliantDevice"
        ],
        "customAuthenticationFactors": [],
        "termsOfUse": []
    }
}