{
    "@odata.type":  "#microsoft.graph.androidCompliancePolicy",
    "description":  "Use this policy to migrate from legacy device administrator enrollment; devices must unenroll and re-enroll with Work profile. Otherwise you can just block device administrator using device enrollment restrictions.",
    "displayName":  "Standard Block Android Device Administrator policy",
    "passwordRequired":  false,
    "passwordMinimumLength":  null,
    "passwordRequiredType":  "deviceDefault",
    "requiredPasswordComplexity":  "none",
    "passwordMinutesOfInactivityBeforeLock":  null,
    "passwordExpirationDays":  null,
    "passwordPreviousPasswordBlockCount":  null,
    "passwordSignInFailureCountBeforeFactoryReset":  null,
    "securityPreventInstallAppsFromUnknownSources":  false,
    "securityDisableUsbDebugging":  false,
    "securityRequireVerifyApps":  false,
    "deviceThreatProtectionEnabled":  false,
    "deviceThreatProtectionRequiredSecurityLevel":  "unavailable",
    "advancedThreatProtectionRequiredSecurityLevel":  "unavailable",
    "securityBlockJailbrokenDevices":  false,
    "securityBlockDeviceAdministratorManagedDevices":  true,
    "osMinimumVersion":  null,
    "osMaximumVersion":  null,
    "minAndroidSecurityPatchLevel":  null,
    "storageRequireEncryption":  false,
    "securityRequireSafetyNetAttestationBasicIntegrity":  false,
    "securityRequireSafetyNetAttestationCertifiedDevice":  false,
    "securityRequireGooglePlayServices":  false,
    "securityRequireUpToDateSecurityProviders":  false,
    "securityRequireCompanyPortalAppIntegrity":  false,
    "conditionStatementId":  null,
    "restrictedApps":  [

                       ]
}
